replace_dict_tel = {
                    'అ': 'A', 'ఆ': 'AA', 'ఇ': 'I', 'ఈ': 'EE', 'ఉ': 'U', 'ఊ': 'OO', 'ఋ': 'RU', 'ज': 'JA', 'ౠ': 'RUU', 'ర': 'R',
                     'ు': 'U', 'మ': 'M', 'ా': 'AA', 'ద': 'DHA', 'గ': 'G', 'ి': 'I', 'ం': 'M', 'డ': 'DA', 'ల': 'LA', 'ఎ': 'E', 'ఏ': 'E',
                    'ఓ': 'O', 'ఐ': 'AI', 'ఔ': 'AU', 'చ': 'CHA', 'ె': 'E', 'వ': 'VA', 'క': 'KA', 'ప': 'PA', 'ో': 'O', 'ూ': 'U', 'ై': 'AI',
                    'బ': 'B', 'జ': 'JA', 'ట': 'TA', 'ే': 'E', 'న': 'NA', 'ఒ': 'O', 'య': 'YA', 'ః': 'AH', 'ఖ': 'K', 'భ': 'B', 'స': 'SA',
                    'ఫ': 'PHA', 'ఘ': 'GHA', 'ఝ': 'JAA', 'ఛ': 'CHA', 'ఞ': 'INI', 'ఠ': 'TAA', 'ఢ': 'DAA', 'ణ': 'NA', 'త': 'THA', 'థ': 'THAA',
                    'ధ': 'DHA', 'ష': 'SHA', 'ఙ': 'GNA', 'ఁ': 'RA', 'హ': 'HA', 'శ': 'SHA', '౦': 'O', 'ొ': 'O', 'ఌ': 'RU', 'à': 'AA', 'ౌ': 'AU',
                    'ళ': 'LA', 'ఱ': 'RA', 'ృ': 'RU', 'ీ': 'EE', 'ड़': 'DAA', 'ౡ': 'RUU', 'ఝూ': 'JHU', 'అే': 'AE', 'ो': 'AE', 'म': 'M',
                    'ु': 'U', 'द': 'D', 'ग': 'G'
                        }
    
replace_dict_kar = {
                    'ಅ': 'A', 'ಬ': 'B', 'ಕ': 'K', 'ಡ': 'D', 'ಇ': 'E', 'ಆ': 'A', 'ಬಿ': 'B', 'ಫ': 'P', 'ಎ': 'E', 'ಈ': 'E',
                    'ಗ': 'G', 'ಸಿ': 'C', 'ಹ': 'H', 'ಜಿ': 'G','ಡಿ': 'D', 'ಜೆ': 'G', 'ಉ': 'A', 'ಆಯ್': 'I',
                    'ಎಚ್': 'H', 'ಪಿ': 'P', 'ಕೆ': 'K', 'ಪಾ': 'P', 'ಪ': 'P',
                    'ರಸ್ತೆ': 'ROAD', 'ರ': 'R', 'ಐ': 'E', 'ಶೇ': 'C', 'ಓ': 'O', 'ಸೇ': 'C', 'ಎನ್': 'N', 'ಬಿನ್': 'B'
                    }

replace_dict_Hin = {
                    'अ': 'A', 'आ': 'AA', 'इ': 'E', 'ई': 'I', 'उ': 'U', 'ऊ': 'OO', 'ए': 'A', 'ऐ': 'AE', 'ओ': 'O', 'औ': 'AO', 'अं': 'AM', 'अः': 'A:',
                    'ऋ': 'RI', 'ॠ': 'RR', 'ा': 'AA', 'ि': 'I', 'ी': 'II', 'ु': 'U', 'ू': 'UU', 'ृ': 'R', 'ॄ': 'RR', 'ॅ': 'E', 'ॆ': 'E', 'े': 'E', 'ै': 'AI',
                    'ॉ': 'O', 'ॊ': 'O', 'ो': 'O', 'ौ': 'AU', 'क': 'K', 'ख': 'KHA', 'ग': 'G', 'घ': 'GHA', 'ङ': 'NGA', 'च': 'CA', 'छ': 'CHHA', 'ज': 'JA',
                    'झ': 'JHA', 'ञ': 'NYA', 'ट': 'TA', 'ठ': 'THH', 'ड': 'DA', 'ढ': 'DH', 'ण': 'N', 'त': 'T', 'थ': 'THA', 'द': 'D', 'ध': 'DHA', 'न': 'NA',
                    'प': 'P', 'फ': 'FA', 'ब': 'B', 'भ': 'BHA', 'म': 'MA', 'य': 'Y', 'र': 'R', 'ल': 'LA', 'व': 'V', 'श': 'SHA', 'ष': 'SHHA', 'स': 'SA',
                    'ह': 'HA', 'क्ष': 'KSH', 'त्र': 'TRA', 'ज्ञ': 'GYA', '१': '1', '२': '2', '३': '3', '४': '4', '५': '5', '६': '6', '७': '7',
                    '८': '8', '९': '9'
                    }

replace_dict_Od = {
                    'ଅ': 'A', 'ଆ': 'AA', 'ଇ': 'I', 'ଈ': 'II', 'ଉ': 'U', 'ଊ': 'UU', 'ଋ': 'R', 'ଌ': 'L', 'ଏ': 'E', 'ଐ': 'AI', 'ଓ': 'O', 'ଔ': 'AU',
                    'ା': 'AA', 'ି': 'I', 'ୀ': 'II', 'ୁ': 'U', 'ୂ': 'UU', 'ୃ': 'R', 'ୄ': 'RR', 'େ': 'E', 'ୈ': 'AI', 'ୋ': 'O', 'ୌ': 'AU', 'କ': 'KA',
                    'ଖ': 'GA', 'ଘ': 'GHA', 'ଙ': 'NGA', 'ଚ': 'CA', 'ଛ': 'CHA', 'ଜ': 'JA', 'ଝ': 'JHA', 'ଞ': 'NYA', 'ଟ': 'TTA', 'ଠ': 'TTHA', 'ଡ': 'DDA',
                    'ଢ': 'DDHA', 'ଣ': 'NNA', 'ତ': 'TA', 'ଥ': 'THA', 'ଦ': 'DA', 'ଧ': 'DHA', 'ନ': 'NA', 'ପ': 'PA', 'ଫ': 'PHA', 'ବ': 'BA', 'ଭ': 'BHA',
                    'ମ': 'MA', 'ଯ': 'YA', 'ର': 'RA', 'ଲ': 'LA', 'ଳ': 'LLA', 'ଵ': 'VA', 'ଶ': 'SHA', 'ଷ': 'SSA', 'ସ': 'SA', 'ହ': 'HA', 'ଡ଼': 'RRA',
                    'ଢ଼': 'RHA', 'ୟ': 'YYA', '୧': '1', '୨': '2', '୩': '3', '୪': '4', '୫': '5', '୬': '6', '୭': '7', '୮': '8','୯': '9'
                    }

pattern_eng = r'(\d[a-zA-Z]+)|([a-zA-Z]\d+)'
pattern_hi = r'(\d[a-zA-Z\u0900-\u097F\u200d]+)|([a-zA-Z\u0900-\u097F\u200d]\d+)'
pattern_tel = r'(\d[a-zA-Z\u0C00-\u0C7F]+)|([a-zA-Z\u0C00-\u0C7F]\d+)'
pattern_kan = r'(\d[a-zA-Z\u0C80-\u0CFF]+)|([a-zA-Z\u0C80-\u0CFF]\d+)'
pattern_od = r'(\d[a-zA-Z\u0B00-\u0B7F]+)|([a-zA-Z\u0B00-\u0B7F]\d+)'