Repository: pypi-data/pypi-mirror-330
Catalog: packages/django-datashow/django_datashow-0.1.10.tar.gz/django_datashow-0.1.10/datashow/locale/*/LC_MESSAGES/django.po
Languages: de

source: Initialize datasets
de: Initialisiere Datensätze

source: Datasets initialized.
de: Datensätze initialisiert.

source: Advanced
de: Fortgeschritten

source: Generate FTS tables
de: FTS-Tabellen generieren

source: Make visible
de: Als sichtbar in Tabellen-Ansicht markieren

source: Make invisible
de: Als nicht sichtbar in Tabellen-Ansicht markieren

source: Make visible_detail
de: Als sichtbar in Detail-Ansicht markieren

source: Make invisible_detail
de: Als nicht sichtbar in Detail-Ansicht markieren

source: Make sortable
de: Als sortierbar markieren

source: Make unsortable
de: Als nicht sortierbar markieren

source: Make searchable
de: Als durchsuchbar markieren

source: Make unsearchable
de: Als nicht durchsuchbar markieren

source: Enter a valid start value.
de: Einen validen Startwert angeben.

source: Enter a valid end value.
de: Einen validen Endwert angeben.

source: Yes
de: Ja

source: No
de: Nein

source: Sort by
de: Sortieren nach

source: Search term
de: Suchbegriff

source: The name of the dataset.
de: Der Name des Datensatzes.

source: Slug
de: URL-Kürzel

source: Unique slug for the dataset.
de: Eindeutiges URL-Kürzel für den Datensatz.

source: Description
de: Beschreibung

source: Description for the dataset, default rendered as Markdown/HTML!
de: Beschreibung des Datensatzes, wird standardmäßig als Markdown/HTML ausgegeben!

source: Created At
de: Erstellt am

source: The date and time when the dataset was created.
de: Zeitpunkt der Erstellung des Datensatzes.

source: Updated At
de: Aktualisiert am

source: The date and time when the dataset was last updated.
de: Zeitpunkt der letzten Aktualisierung des Datensatzes.

source: Is public
de: Ist öffentlich

source: Indicates whether the dataset is publicly accessible.
de: Gibt an, ob dieser Datensatz öffentlich zugänglich ist.

source: Is listed
de: Wird aufgelistet

source: Indicates whether the dataset is listed.
de: Gibt an, ob dieser Datensatz aufgelistet wird.

source: SQLite File
de: SQLite-Datei

source: Upload the SQLite file for the dataset.
de: Eine SQLite-Datei für diesen Datensatz hochladen.

source: The version number of the dataset.
de: Die Versionsnummer des Datensatzes.

source: Default Table
de: Voreingestellte Tabelle

source: The default table is displayed instead of a list of all tables.
de: Die voreingestellte Tabelle wird an Stelle einer Liste aller Tabellen angezeigt.

source: Dataset
de: Datensatz

source: Datasets
de: Datensätze

source: Internal name of the table.
de: Interner Name der Tabelle.

source: Label
de: Beschriftung

source: Displayed label for the table.
de: Angezeigte Beschriftung für diese Tabelle.

source: Row Count
de: Zeilenanzahl

source: The number of rows in the table.
de: Die Anzahl der Zeilen in der Tabelle.

source: Visible
de: Sichtbar

source: Indicates whether the table is visible.
de: Gibt an, ob diese Tabelle sichtbar ist.

source: Row label template
de: Zeilen-Beschriftungsvorlage

source: Python format template for labeling rows.
de: Python-Formavorlage um Zeilen zu beschriften.

source: Row description template
de: Zeilen-Beschreibungsvorlage

source: Python format template for describing rows / rendered as Markdown/HTML!
de: Python-Formavorlage zur Beschreibung von Zeilen / angezeigt als Markdown/HTML!

source: Primary Key Column
de: Primärschlüsselspalte

source: For use in identifying rows in URLs.
de: Um einzelne Zeilen über URL-Parameter zu identifizieren.

source: Pagination Size
de: Paginierungsgröße

source: The number of rows per page.
de: Die Anzahl der Zeilen pro Seite.

source: SQL representation
de: SQL-Repräsentation

source: Makes this table 'virtual' by representing this table with this SQL query.
de: Eintrag macht diese Tabelle ‘virtuell’ und repräsentiert sie durch diese SQL Abfrage.

source: Table
de: Tabelle

source: Tables
de: Tabellen

source: Primary Key Column needs to be part of this table.
de: Primärschlüsselspalte muss Teil dieser Tabelle sein.

source: Row label template formatting error: %s
de: Fehler in der Zeilen-Beschriftungsvorlage: %s

source: Row description template formatting error: %s
de: Fehler in der Zeilen-Beschreibungsvorlage: %s

source: Plaintext
de: Text

source: Float
de: Gleitkommazahl

source: Integer
de: Ganzzahl

source: Date
de: Datum

source: Date and time
de: Datum und Zeit

source: Boolean
de: Boolescher Wert

source: Summary
de: Zusammenfassung

source: Abbreviation
de: Abkürzung

source: Integer Range
de: Auswahl des Ganzzahl-Bereichs

source: Internal name of the column.
de: Interner Name der Spalte.

source: Displayed label of the column.
de: Angezeigte Beschriftung der Spalte.

source: Order
de: Reihenfolge

source: Order of the column.
de: Reihenfolge der Spalte.

source: Indicates whether the column is visible in table view.
de: Gibt an, ob diese Spalte in der Tabellen-Ansicht sichtbar ist.

source: Visible in detail
de: Sichtbar in Detail-Ansicht

source: Indicates whether the column is visible in detail view.
de: Gibt an, ob diese Spalte in der Detail-Ansicht sichtbar ist.

source: Sortable
de: Sortierbar

source: Indicates whether the column is sortable.
de: Gibt an, ob diese Spalte sortierbar ist.

source: Searchable
de: Durchsuchbar

source: Indicates whether the column is included in search queries.
de: Gibt an, ob diese Spalte in Suchanfragen berücksichtigt wird.

source: Facet Count
de: Anzahl Facetteneinträge

source: Number of facet entries, 0 if disabled.
de: Anzahl der Einträge für diese Facette, 0 zum deaktivieren.

source: Prefix
de: Präfix

source: Prefix when outputting the column value.
de: Präfix für die Ausgabe des Spaltenwerts.

source: Postfix
de: Suffix

source: Postfix when outputting the column value.
de: Suffix für die Ausgabe des Spaltenwerts.

source: Formatter
de: Formatierer

source: Formatter for the column.
de: Formatierer für die Spalte.

source: Formatter Arguments
de: Formattierer-Argumente

source: Arguments for the formatter.
de: Argumente für den Formatierer.

source: Filter function for the column.
de: Filterfunktion für die Spalte.

source: Filter Arguments
de: Filter-Argumente

source: Arguments for the selected filter.
de: Argumente für den ausgewählten Filter.

source: Column
de: Spalte

source: Columns
de: Spalten

source: Reset
de: Zurücksetzen

source: Search
de: Suchen

source: %(count)s row
de: %(count)s Zeile

source: remove filter
de: Filter entfernen

source: sort ascending
de: Sortiere aufsteigend

source: remove sort ascending
de: Aufsteigende Sortierung entfernen

source: sort descending
de: Sortiere absteigend

source: remove sort descending
de: Absteigende Sortierung entfernen

source: Showing %(count)s of %(total_count)s rows.
de: Zeige %(count)s von %(total_count)s Zeilen.

source: Total of %(total_count)s rows.
de: Insgesamt %(total_count)s Zeilen.

source: Export view as CSV
de: CSV dieser Ansicht exportieren

source: rows
de: Zeilen

source: Download SQLite database
de: SQLite-Datenbank herunterladen

source: Pagination
de: Paginierung

source: previous
de: zurück

source: (current page)
de: (aktuelle Seite)

source: next
de: weiter

# url part
source: <slug:slug>/table/<slug:table_slug>/
de: <slug:slug>/tabelle/<slug:table_slug>/

# url part
source: <slug:slug>/table/<slug:table_slug>/export/
de: <slug:slug>/tabelle/<slug:table_slug>/export/

# url part
source: <slug:slug>/table/<slug:table_slug>/<slug:row_slug>/
de: <slug:slug>/tabelle/<slug:table_slug>/<slug:row_slug>/
