Repository: pypi-data/pypi-mirror-330
Catalog: packages/django-crm-admin/django_crm_admin-1.2.1.tar.gz/django_crm_admin-1.2.1/locale/*/LC_MESSAGES/django.po
Languages: he

source: Analytics
he: ניתוח נתונים (אנליטיקה)

source: IncomeStat Snapshot
he: תמונת מצב של IncomeStat

source: IncomeStat Snapshots
he: * "IncomeStat" נשאר כפי שהוא, מכיוון שזה שם מותג/מוצר.

source: Sales Report
he: דוח מכירות

source: Request Summary
he: סיכום בקשות

source: Requests Summary
he: סיכום בקשות

source: Lead source Summary
he: סיכום מקור הליד

source: Closing reason Summary
he: סיכום סיבת סגירה

source: Deal Summary
he: סיכום עסקה

source: Income Summary
he: סיכום הכנסות

source: Sales funnel
he: צינור מכירות

source: Conversion Summary
he: סיכום המרה

source: Payment date
he: תאריך תשלום

source: Products
he: מוצרים

source: Closing reason over month
he: סיבות לסגירה לפי חודשים

source: Conversion of requests into successful deals (for the last 365 days)
he: המרת בקשות לעסקאות מוצלחות (למעלה מ-365 ימים אחורה)

source: Conversion of primary requests
he: המרת בקשות ראשוניות

source: Conversion
he: המרה

source: Total requests
he: סה"כ בקשות

source: Total primary requests
he: סך הבקשות הראשוניות

source: Deal Summary for last 365 days
he: סיכום עסקאות לשנה האחרונה (365 ימים)

source: Total deals
he: עסקאות בסך הכל

source: Relevant deals
he: עסקאות רלוונטיות

source: Closed successfully (primary)
he: סגור בהצלחה (ראשוני)

source: Average days to close successfully (primary)
he: ממוצע הימים לסגירה מוצלחת (עיקרית)

source: Irrelevant deals
he: עסקאות לא רלוונטיות

source: Won deals
he: עסקאות מוצלחות

source: The snapshot has been saved successfully.
he: הצילום נשמר בהצלחה.

source: Income monthly (total amount for the current period: {} {} ({}))
he: הכנסה חודשית (סכום כולל לתקופה הנוכחית: {} {} ({}))

source: Income monthly in the previous period
he: הכנסה חודשית בתקופה הקודמת

source: Payments received
he: תשלומים שהתקבלו

source: Amount
he: סכום

source: Order
he: הזמנה

source: Guaranteed income
he: הכנסה מובטחת

source: High probability income
he: הכנסה בעלת הסתברות גבוהה

source: Low probability income
he: הכנסה בעלי הסתברות נמוכה

source: Income averaged over the year ({}).
he: הכנסה ממוצעת לאורך השנה ({}).

source: Total won deals
he: סך העסקאות המוצלחות

source: Average won deals a month
he: ממוצע עסקאות מוצלחות בחודש

source: Average income amount a month
he: סכום ההכנסה הממוצע לחודש

source: Total amount
he: סכום כולל

source: Request source statistics
he: סטטיסטיקות מקור הבקשות

source: Number of requests for each source
he: מספר הבקשות לכל מקור

source: Requests over country
he: בקשות לפי מדינות

source: for all period
he: לכל התקופה

source: for last 365 days
he: ל-365 הימים האחרונים

source: conversion
he: המרה

source: Not specified
he: לא צוין

source: Relevant requests over month
he: בקשות רלוונטיות לפי חודשים

source: pcs
he: חתיכות (בקיצור: חת' או יח')

source: Country
he: מדינה

source: All
he: הכל

source: Owner
he: בעלים

source: Product
he: מוצר

source: Sold products summary (by date of payment receipt)
he: סיכום מוצרים שנמכרו (לפי תאריך קבלת התשלום)

source: Sold products
he: מוצרים שנמכרו

source: Price
he: מחיר

source: Request Summary for last 365 days
he: סיכום בקשות לשנה האחרונה (365 ימים)

source: Conversion of primary requests into successful deals
he: המרת בקשות ראשוניות לעסקאות מוצלחות

source: Primary requests
he: בקשות ראשוניות

source: Subsequent requests
he: בקשות עוקבות

source: Conversion of subsequent requests
he: המרת בקשות המשך

source: average monthly value
he: ערך חודשי ממוצע

source: Requests by month
he: בקשות לפי חודשים

source: Relevant requests
he: בקשות רלוונטיות

source: Total closed deals
he: סך העסקאות הסגורות

source: Statistics on the Closing reason of deals for all the time
he: סטטיסטיקה על סיבת סגירת העסקאות לכל התקופה

source: total requests
he: בקשות בסך הכל

source: Switch currency
he: החלף מטבע

source: Save snapshot
he: שמור צילום מסך

source: Sales funnel for last 365 days
he: מסלול המכירות ב-365 הימים האחרונים

source: The number of closed deals in stages
he: מספר העסקאות הנסגרות בשלבים

source: Chart
he: תרשים

source: The percentages show the number of "lost" deals at each stage.
he: האחוזים מציגים את מספר העסקאות "אבדות" בכל שלב.

source: Charts
he: תרשימים

source: Note! The calculations use data for the whole year. But the charts begin on the first of the next month.
he: שימו לב! החישובים משתמשים בנתונים עבור כל השנה. אבל הגרפים מתחילים מהראשון של החודש הבא.

source: Data
he: נתונים

source: Snapshots
he: הערה: "צילומי מסך" הוא תרגום חופשי של "Snapshots", אך הוא מעביר את המשמעות בצורה מדויקת בהקשר זה. המילה "Снимки" ברוסית גם כן יכולה להתפרש כצילומי מסך או תמונות, ולכן התרגום העברי מתאים להקשר.

source: Now
he: עכשיו

source: Chat
he: צ'אט

source: Please write a message
he: בבקשה כתוב הודעה.

source: Please select at least one recipient
he: בבקשה בחרו לפחות בנמען אחד

source: message
he: הודעה

source: messages
he: הודעות

source: Message
he: הודעה

source: answer to
he: תשובה ל־

source: recipients
he: נמענים

source: to
he: ל

source: Creation date
he: תאריך יצירה

source: task operator
he: מפעיל משימות

source: You received a message regarding -
he: (המשך הטקסט יופיע לאחר הנקודה הזו)

source: Additional information
he: מידע נוסף

source: Recipients
he: נמענים

source: reply
he: השב

source: Reply to
he: השב אל

source: Add %(name)s
he: הוסף %(name)s

source: Send
he: שלח

source: Close
he: סגור

source: Delete
he: מחיקה

source: From
he: מאת

source: View in CRM
he: הצג ב-CRM

source: Add chat message
he: הוסף הודעה לצ'אט

source: There are unread messages
he: <|im_end|>

source: View chat messages
he: הצגת הודעות צ'אט

source: You can specify the name of an existing file on the server along with the path instead of uploading it.
he: ניתן לציין את שם הקובץ הקיים בשרת יחד עם הנתיב במקום להעלות אותו.

source: staff
he: צוות עובדים

source: superuser
he: משתמש על-מערכתי

source: Common
he: משותף

source: Update date
he: תאריך עדכון

source: Modified By
he: שונה על ידי

source: was added successfully.
he: תווסף בהצלחה.

source: Re-adding blocked.
he: הוספה מחדש נחסמה.

source: Department
he: מחלקה

source: Department and Owner do not match
he: המחלקה והבעלים אינם תואמים זה את זה

source: Departments
he: מחלקות

source: Default country
he: מדינה ברירת מחדל

source: Default currency
he: מטבע ברירת מחדל

source: Works globally
he: פועל באופן גלובלי

source: The department operates in foreign markets.
he: המחלקה פועלת בשווקים זרים.

source: Reminder
he: תזכורת

source: Reminders
he: תזכורות

source: Subject
he: נושא

source: Briefly what about is this reminder
he: תזכורת זו מזכירה לך לשלם את החשבון עד לתאריך ה-15 לחודש.

source: Description
he: תיאור

source: Reminder date
he: תאריך תזכורת

source: Active
he: פעיל

source: Send notification email
he: שלח אימייל הודעה

source: File
he: קובץ

source: Files
he: קבצים

source: Attached file
he: קובץ מצורף

source: Attach to the deal
he: הצמד לעסקה

source: Stage
he: שלב

source: Stages
he: שלבים

source: Default
he: ברירת מחדל

source: Will be selected by default when creating a new task
he: יסומן כברירת מחדל בעת יצירת משימה חדשה

source: The sequence number of the stage. The indices of other instances will be sorted automatically.
he: מספר הסידורי של השלב. אינדקסים של מופעים אחרים ימוינו אוטומטית.

source: User profile
he: פרופיל משתמש

source: User profiles
he: פרופילי משתמשים

source: Phone
he: טלפון

source: UTC time zone
he: אזור זמן UTC

source: Activate this time zone
he: הפעל אזור זמן זה

source: Field for temporary storage of messages to the user
he: שדה לאחסון זמני של הודעות למשתמש

source: Tags
he: תוויות

source: Add tags
he: הוסף תגיות

source: Export selected objects
he: ייצוא עצמים נבחרים

source: Next step deadline
he: מועד אחרון לשלב הבא

source: Filters may affect search results.
he: מסננים עלולים להשפיע על תוצאות החיפוש.

source: Act
he: פעולה

source: Workflow
he: זרימת עבודה

source: Language
he: שפה

source: Save
he: שמור

source: Save and continue editing
he: שמור והמשך לערוך

source: Save and view
he: שמור והצג

source: History
he: היסטוריה

source: View on site
he: הצגת האתר

source: Home
he: דף הבית

source: Please select the department to copy.
he: בבקשה בחרו את המחלקה להעתקה.

source: Submit
he: שלח/י

source: Note
he: הערה

source: Attachments
he: קבצים מצורפים

source: Download
he: הורדה

source: Error: the file is missing.
he: שגיאה: הקובץ חסר.

source: Due date
he: תאריך יעד

source: Priority
he: עדיפות

source: Co-owner
he: שותף בעלים

source: Responsible
he: אחראים

source: There are reminders
he: ישנם תזכורות

source: Create a reminder
he: יצירת תזכורת

source: Regarding
he: בנוגע ל

source: Please select an Email account
he: נא בחרו חשבון דוא"ל

source: Select
he: בחר

source: Import
he: יבוא

source: Spam
he: דואר זבל

source: Mark as read
he: This phrasing directly conveys the meaning of marking something as having been read.

source: Mark as
he: סימון בתור

source: To
he: אל

source: This email is already imported.
he: דוא"ל זה כבר מיובא.

source: Please select a user and a new department for him.
he: נא בחרו משתמש ומחלקה חדשה עבורו.

source: User
he: משתמש

source: Task completed
he: משימה הושלמה

source: I completed the task
he: השלמתי את המשימה

source: Completed
he: הושלם

source: The name has been added for translation. Please update po and mo files.
he: השם נוסף לתרגום. אנא עדכן את קבצי ה-po וה-mo.

source: Copy
he: העתקה

source: {} with ID '{}' doesn’t exist. Perhaps it was deleted?
he: {} עם מזהה '{}' לא קיים. אולי הוא נמחק?

source: A new department has been created - {}. Please rename it.
he: נוצר מחלקה חדשה - {}. אנא שנה את שמה.

source: You do not have mail accounts marked for importing emails.Please contact your administrator.
he: אין לך חשבונות דוא"ל מסומנים לייבוא הודעות. אנא פנה למנהל המערכת שלך.

source: Attention! Data for filters such as: transaction stages, reasons for closing, tags, etc. will be transferred only if the new department has data with the same name. Also Output, Payment and Product will not be affected.
he: כמו כן, זה לא ישפיע על תוצאה, תשלום ומוצר.

source: User transferred successfully
he: המשתמש הועבר בהצלחה

source: Contact details
he: פרטי קשר

source: Name
he: שם

source: Contact info
he: פרטי קשר

source: Relations
he: קשרים

source: A country must be specified.
he: יש לציין מדינה.

source: Marketing currency already exists.
he: מטבע שיווקי כבר קיים.

source: State currency already exists.
he: מטבע המדינה כבר קיים.

source: Enter a valid alphabetic code.
he: הזן קוד אלפביתי תקני.

source: The currency cannot be both state and marketing.
he: המטבע לא יכול להיות גם ממלכתי וגם שיווקי.

source: Not allowed address
he: כתובת לא מורשית

source: City does not match the country
he: העיר אינה תואמת את המדינה

source: Such an object already exists
he: עצם כזה כבר קיים

source: Please fill in the field.
he: נא מלא את השדה.

source: To convert, please fill in the fields below.
he: כדי להמיר, אנא מלאו את השדות הבאים.

source: Specify the deal amount
he: ציין את סכום העסקה

source: Contact does not match the company
he: הקשר אינו תואם את החברה

source: Select only Contact or only Lead
he: בחירה של קשר בלבד או ליד בלבד

source: Select only Company or only Lead
he: בחרו רק חברה או רק ליד (הובלה)

source: First select a department.
he: ראשית, בחר מחלקה.

source: That tag already exists.
he: תג זה כבר קיים.

source: Your name
he: שמך

source: Your E-mail
he: כתובת הדוא"ל שלך

source: Phone number (with country code)
he: מספר טלפון (כולל קוד מדינה)

source: Company name
he: שם החברה

source: Sorry, invalid reCAPTCHA. Please try again or send an email.
he: צער לי, reCAPTCHA לא חוקי. נא נסה שוב או שלח אימייל.

source: The name of the contact person (one word).
he: שם איש הקשר (מילה אחת).

source: First name
he: שם פרטי

source: Middle name
he: שם פרטי שני (תואר האב)

source: The middle name of the contact person.
he: שם האמצע של איש הקשר.

source: The last name of the contact person (one word).
he: שם המשפחה של איש הקשר (מילה אחת).

source: Last name
he: שם משפחה

source: The title (position) of the contact person.
he: כותרת (תפקיד) איש הקשר.

source: Title / Position
he: כותרת / תפקיד

source: Sex
he: מין

source: Date of Birth
he: תאריך לידה

source: Secondary email
he: מייל משני

source: Mobile phone
he: טלפון נייד

source: City
he: עיר

source: Company city
he: עיר החברה

source: Object of City in database
he: עצם העיר בבסיס הנתונים

source: Address
he: כתובת

source: Disqualified
he: פסול

source: Use comma to separate Emails.
he: השתמשו בפסיק כדי להפריד בין כתובות הדוא"ל.

source: Lead Source
he: מקור ליד

source: Mass mailing
he: דואר זבל המוני

source: Mailing list recipient.
he: נמען רשימת תפוצה.

source: Last contact date
he: תאריך הקשר האחרון

source: Assigned to
he: מוקצה ל

source: Company
he: חברה

source: Companies
he: חברות

source: Alternative names
he: שמות חלופיים

source: Separate them with commas.
he: פריד ביניהם באמצעות פסיקים.

source: Website
he: אתר אינטרנט

source: City name
he: שם העיר

source: Registration number
he: מספר רישום

source: Registration number of Company
he: מספר רישום של החברה

source: country
he: מדינה

source: Company Country
he: מדינת החברה

source: Type of company
he: סוג החברה

source: Industry of company
he: ענף החברה

source: Contact person
he: איש קשר

source: Contact persons
he: אנשי קשר

source: Company of contact
he: חברת איש הקשר

source: has already been assigned to the city
he: כבר הוקצה לעיר

source: Countries
he: מדינות

source: Cities
he: ערים

source: Email
he: דוא"ל

source: Emails in CRM
he: מיילים ב-CRM

source: You can specify multiple addresses, separated by commas
he: ניתן לציין מספר כתובות, מופרדות בפסיקים.

source: The Email address of sender
he: כתובת הדוא"ל של השולח

source: Request a read receipt
he: בקש אישור קריאה

source: Not supported by all mail services.
he: לא נתמך על ידי כל שירותי הדואר.

source: Deal
he: עסקה

source: Lead
he: ניהול הובלות הוא תהליך קריטי בעסקים רבים, מכיוון שהוא עוזר לזהות, לעקוב ולנהל את האינטראקציות עם לקוחות פוטנציאליים. זה מאפשר לצוותי מכירות להתמקד באנשים בעלי הסיכוי הגבוה ביותר להפוך ללקוחות משלמים, ולספק להם חוויה מותאמת אישית ויעילה.

source: Contact
he: נקודת קשר

source: Request
he: בקשה

source: Deals
he: עסקאות

source: Deal name
he: שם העסקה

source: Next step
he: השלב הבא

source: Describe briefly what needs to be done in the next step.
he: תיארו בקצרה מה צריך לעשות בצעד הבא.

source: Step date
he: תאריך שלב

source: Date to which the next step should be taken.
he: תאריך עד אליו יש לבצע את הצעד הבא.

source: Dates of the stages
he: תאריכי שלבים

source: Dates of passing the stages
he: תאריכי מעבר שלבים

source: Date of deal closing
he: תאריך סגירת העסקה

source: Date of won deal closing
he: תאריך סגירת העסקה המוצלחת

source: Total deal amount without VAT
he: סכום העסקה הכולל ללא מע"מ

source: Currency
he: מטבע

source: Closing reason
he: סיבת סגירה

source: Probability (%)
he: סבירות (%)

source: Partner contact
he: יצירת קשר עם שותף

source: Contact person of dealer or distribution company
he: איש קשר של חברת סוחרים או הפצה

source: Relevant
he: רלוונטית

source: Important
he: חשוב

source: Remind me.
he: הזכיר לי.

source: Leads
he: לידים

source: Company phone
he: טלפון החברה

source: Company address
he: כתובת החברה

source: Company email
he: דוא"ל של החברה

source: Type of Clients
he: סוג הלקוחות

source: Types of Clients
he: סוגי לקוחות

source: Industry of Clients
he: ענף הלקוחות

source: Industries of Clients
he: תעשיות הלקוחות

source: Second default
he: ברירת מחדל שנייה

source: Will be selected next after the default stage.
he: יבחר הבא בתור לאחר שלב ברירת המחדל.

source: success stage
he: שלב ההצלחה

source: conditional success stage
he: שלב הצלחה מותנית

source: For example, receiving the first payment
he: לדוגמה, קבלת התשלום הראשון

source: goods shipped
he: סחורה נשלחה

source: Have the goods been shipped at this stage already?
he: האם הסחורה כבר נשלחה בשלב זה?

source: Lead Sources
he: מקורות לידים

source: form template name
he: שם תבנית טופס

source: The name of the html template file if needed.
he: שם קובץ התבנית של HTML במידת הצורך.

source: success page template name
he: שם תבנית עמוד ההצלחה

source: Reason rating. The indices of other instances will be sorted automatically.
he: דירוג סיבה. אינדקסים של מופעים אחרים ימוינו אוטומטית.

source: success reason
he: סיבת הצלחה

source: Closing reasons
he: סיבות לסגירה

source: Output
he: תוצר

source: Outputs
he: תוצרים

source: Quantity
he: כמות

source: Shipping date
he: תאריך משלוח

source: Shipment date as per contract
he: תאריך המשלוח על פי החוזה

source: Planned shipping date
he: תאריך משלוח מתוכנן

source: Actual shipping date
he: תאריך המשלוח בפועל

source: Date when the product was shipped
he: תאריך משלוח המוצר

source: Shipped
he: נשלח

source: Product is shipped
he: המוצר נשלח

source: serial number
he: מספר סידורי

source: Quantity is required.
he: יש לציין כמות.

source: Shipment
he: משלוח

source: Shipments
he: משלוחים

source: Currencies
he: מטבעות

source: Alphabetic Code for the Representation of Currencies.
he: קוד אלפביתי לייצוג מטבעות.

source: Rate to state currency
he: שיעור למטבע המדינה

source: Exchange rate against the state currency.
he: שיעור החליפין ביחס למטבע המדינה.

source: Rate to marketing currency
he: שיעור המרה למטבע השיווקי

source: Is it the state currency?
he: האם זו המטבע הרשמי של המדינה?

source: Is it the marketing currency?
he: האם זו המטבע השיווקי?

source: This currency is subject to automatic updating.
he: מטבע זה כפוף לעדכון אוטומטי.

source: without VAT
he: ללא מע"מ

source: Please specify a currency.
he: נא לציין מטבע.

source: Payment
he: תשלום

source: Payments
he: תשלומים

source: received
he: התקבל

source: guaranteed
he: מובטח

source: high probability
he: סבירות גבוהה

source: low probability
he: סתברות נמוכה

source: Payment status
he: מצב התשלום

source: contract number
he: מספר חוזה

source: invoice number
he: מספר חשבונית

source: order number
he: מספר הזמנה

source: Payment through representative office
he: תשלום דרך משרד נציגותי

source: Payment share
he: חלק מהתשלום

source: Currency rate
he: שערי מטבע

source: Currency rates
he: שיעורי מטבע

source: approximate currency rate
he: שיעור מטבע משוער

source: official currency rate
he: שיעור החלפין הרשמי

source: Currency rate date
he: תאריך שער המטבע

source: Exchange rate type
he: סוג שער החליפין

source: Product category
he: קטגוריית מוצר

source: Product categories
he: קטגוריות מוצרים

source: On sale
he: במכירה

source: Goods
he: מוצרים

source: Service
he: שירות

source: Type
he: סוג

source: Requests
he: בקשות

source: Request for
he: בקשה ל

source: Lead source
he: מקור ליד

source: Date of receipt
he: תאריך קבלה

source: Date of receipt of the request.
he: תאריך קבלת הבקשה.

source: Translation
he: שמעביר במדויק את המשמעות והטון של הטקסט המקורי באנגלית. השתמשו בידע ובמומחיות שלכם בשפה העברית כדי ליצור תרגום איכותי ומדויק.

source: Remark
he: הערה

source: Pending
he: בהמתנה

source: Waiting for validation of fields filling
he: בהמתנה לאימות השדות הממולאים

source: Subsequent
he: עוקב

source: Received from the client with whom you are already cooperate
he: התקבל מהלקוח איתו אתם כבר משתפים פעולה

source: Duplicate
he: כפיל

source: Duplicate request. The deal will not be created.
he: בקשה כפולה. העסקה לא תיווצר.

source: Verification required
he: נדרשת אימות

source: Links are set automatically and require verification.
he: קישורים מוגדרים אוטומטית ודורשים אימות.

source: Company and contact person do not match.
he: החברה ואדם הקשר אינם תואמים.

source: Specify the contact person or lead. But not both.
he: ציין את איש הקשר או את הליד. אך לא שניהם.

source: Tag
he: תווית

source: Tag name
he: שם התגית

source: competitor
he: מתחרה

source: end customer
he: לקוח סופי

source: reseller
he: משווק משנה

source: dealer
he: סוחר

source: distributor
he: מפיץ

source: educational institutions
he: מוסדות חינוך

source: service companies
he: חברות שירותים

source: welders
he: מחברים (או: מסגרים)

source: capital construction
he: בנייה קפיטליסטית

source: automotive industry
he: תעשיית הרכב

source: shipbuilding
he: בניית אוניות

source: metallurgy
he: מתכתורגיה

source: power generation
he: ייצור חשמל

source: pipelines
he: צינורות הובלה

source: pipe production
he: ייצור צינורות

source: oil & gas
he: נפט וגז

source: aviation
he: תעופה

source: railway
he: מסילת רכבת

source: mining
he: כרייה

source: request
he: בקשה

source: analysis of request
he: ניתוח הבקשה

source: clarification of the requirements
he: הבהרת הדרישות

source: price offer
he: הצעת מחיר

source: commercial proposal
he: הצעה מסחרית

source: technical and commercial offer
he: הצעה טכנית ומסחרית

source: agreement
he: הסכם

source: invoice
he: חשבונית

source: receiving the first payment
he: קבלת התשלום הראשון

source: shipment
he: משלוח

source: closed (successful)
he: סגורה (מוצלחת)

source: The client is not responding
he: הלקוח לא מגיב

source: Specifications are not suitable
he: המפרטים אינם מתאימים

source: The deal was closed successfully
he: העסקה נסגרה בהצלחה

source: Purchase postponed
he: הרכישה נדחתה

source: The price is not competitive
he: המחיר אינו תחרותי

source: website form
he: טופס אתר אינטרנט

source: website email
he: מייל האתר

source: exhibition
he: תערוכה

source: Establish the first contact with the client.
he: כונן את הקשר הראשוני עם הלקוח.

source: Attention! You can only view companies associated with your department.
he: שים לב! ניתן לצפות רק בחברות הקשורות למחלקה שלך.

source: Warning:
he: אזהרה:

source: Owner will also be changed for contact persons.
he: בעלים של אנשי קשר ישתנה גם כן.

source: Change owner of selected Companies
he: שינוי בעלים של חברות נבחרות

source: Your Excel file
he: קובץ ה-Excel שלך

source: Signature
he: חתימה

source: Please note that this is a list of unsent emails.
he: נא שימו לב שזהו רשימה של אימיילים שלא נשלחו.

source: Emails in the CRM database.
he: אימיילים במסד הנתונים של CRM.

source: Box
he: תיבה

source: Content
he: תוכן

source: Previous correspondence
he: התכתבות קודמת

source: No subject
he: ללא נושא

source: View website in new tab
he: צפייה באתר בכרטיסייה חדשה

source: Callback to smartphone
he: שיחת חזרה לסמארטפון

source: Callback to your smartphone
he: החזרה שיחה לסמארטפון שלך

source: Skype chat
he: צ'אט סקייפ

source: Chat or Skype call
he: שיחת צ'אט או שיחת סקייפ

source: Skype call
he: שיחת סקייפ

source: To call a mobile or landline from Skype
he: לחייג לנייד או לקו קבוע מסקייפ

source: Viber chat
he: צ'אט וייבר

source: Chat or viber call
he: שיחת צ'אט או שיחת Viber

source: WhatsApp chat
he: צ'אט וואטסאפ

source: Chat or WhatsApp call
he: שיחה בצ'אט או שיחת וואטסאפ

source: Signed up for email newsletters
he: רשום לניוזלטרים בדוא"ל

source: Unsubscribed from email newsletters
he: ביטול הרשמה לניוזלטרים בדוא"ל

source: Create Email
he: יצירת אימייל

source: Note massmail is not performed on the following days: Friday, Saturday, Sunday.
he: שימו לב שדואר זבל אינו מבוצע בימים הבאים: שישי, שבת, ראשון.

source: Messengers
he: שליחים

source: State currency must be specified.
he: יש לציין את המטבע המדינתי.

source: Marketing currency must be specified.
he: יש לציין את מטבע השיווק.

source: Closing date
he: תאריך סגירה

source: View Contact in new tab
he: הצג קשר בכרטיסייה חדשה

source: View Company in new tab
he: צפייה בחברה בכרטיסייה חדשה

source: Deal counter
he: מונה עסקאות

source: View Lead in new tab
he: הצג ליד בכרטיסייה חדשה

source: Unanswered email
he: מייל ללא תגובה

source: Unread chat message
he: This translation accurately conveys the original meaning while being natural in Hebrew.

source: Payment received
he: תשלום התקבל

source: Specify the date of shipment
he: ציין את תאריך המשלוח

source: Specify products
he: ציין מוצרים

source: Expired shipment date
he: תאריך משלוח פג תוקף

source: Relevant deal
he: עסקה רלוונטית

source: Deal with ID '{}' does not exist. Perhaps it was deleted?
he: עסקה עם מזהה '{}' לא קיימת. אולי היא נמחקה?
