Repository: pypi-data/pypi-mirror-330
Catalog: packages/django-crm-admin/django_crm_admin-1.2.1.tar.gz/django_crm_admin-1.2.1/locale/*/LC_MESSAGES/django.po
Languages: he

source: Please select what's your phone number, caller display
he: נא בחרו מהו מספר הטלפון שיוצג כשלכם בעת שיחות יוצאות.

source: You do not have a VoiP connection configured. Please contact your administrator.
he: אין לך חיבור VoIP מוגדר. אנא פנה למנהל המערכת.

source: That something is wrong ((. Notify the administrator.
he: משהו לא בסדר ((. עדכן/י את המנהל/ת.

source: Expect a call to your smartphone
he: ציפו לשיחת טלפון לסמארטפון שלכם

source: An outgoing call to
he: שיחה יוצאת ל-

source: An incoming call from
he: שיחה נכנסת מ

source: (duration: {duration} minutes)
he: (משך: {duration} דקות)

source: Untitled
he: ללא כותרת

source: Main Menu
he: תפריט ראשי
