Repository: pypi-data/pypi-mirror-330
Catalog: packages/django-crm-admin/django_crm_admin-1.2.1.tar.gz/django_crm_admin-1.2.1/locale/*/LC_MESSAGES/django.po
Languages: he

source: View the Request
he: הצג בקשה

source: Create Email to Contact
he: יצירת אימייל ליצירת קשר

source: Create Email to Lead
he: יצירת אימייל להובלה (Lead)

source: Important deal
he: עסקה חשובה

source: I have been waiting for an answer to my request for %d days
he: אני ממתין לתשובה לבקשתי כבר %d ימים.

source: Expected
he: צפוי

source: Paid
he: שולם

source: Contact is Lead (no company)
he: הקשר הוא ליד (ללא חברה)

source: Person contact details
he: פרטי קשר של אדם

source: Additional person details
he: פרטים נוספים על האדם

source: Company contact details
he: פרטי קשר של החברה

source: The lead "{obj}" has been converted successfully.
he: הליד "{obj}" הומר בהצלחה.

source: This Lead is disqualified! Please read the description.
he: הליד הזה אינו זכאי! נא קרא את התיאור.

source: Client Loyalty
he: נאמנות לקוחות

source: Country not specified in request
he: מדינה לא צוינה בבקשה

source: You received the deal
he: קיבלת את העסקה

source: You are the co-owner of the deal
he: אתה בעל שותף של העסקה

source: Primary request
he: בקשה ראשונית

source: You are the co-owner of the request
he: אתה בעל שותף של הבקשה

source: You received the request
he: קבלת את הבקשה

source: pending
he: בהמתנה

source: processed
he: מעובד

source: Status
he: מצב

source: Subsequent request
he: בקשה עוקבת

source: Found the counterparty assigned to
he: נמצא הצד הנגדי שהוקצה ל-

source: The {name} “{obj}” was added successfully.
he: הפריט "{name}" בשם "{obj}" נוסף בהצלחה.

source: actual
he: מהותית

source: Actual shipping date.
he: תאריך המשלוח בפועל.

source: Deal is paid.
he: העסקה שולמה.

source: Next<br>payment
he: תשלום הבא

source: order
he: הזמנה

source: The product has not been shipped yet.
he: המוצר עדיין לא נשלח.

source: The product has been shipped.
he: המוצר נשלח.

source: Product shipment
he: משלוח המוצר

source: to contract
he: על פי החוזה

source: Date of shipment according to a contract.
he: תאריך המשלוח לפי החוזה.

source: View the deal
he: הצג עסקה

source: paid
he: שולם

source: Please correct the error below.
he: נא לתקן את השגיאה למטה.

source: Please correct the errors below.
he: התרגום הרוסי מציע לתקן "שגיאה" ביחיד, בעוד שהטקסט האנגלי מדבר על "שגיאות" ברבים. לכן, התרגום העברי צריך לשקף את הריבוי.

source: Save as new
he: שמור כ

source: Save and add another
he: שמור והוסף עוד

source: Сorrespondence
he: התכתבות

source: Contacts
he: קשרים

source: Got massmails
he: מיילים המוניים שהתקבלו

source: Massmails
he: דואר זבלוני

source: Open in Admin
he: (Translation: Open in Admin)

source: Make Massmail
he: יצירת מייל המוני

source: Export all
he: ייצוא הכל

source: reply all
he: הערה: בתרגום לעברית, המונח "השב לכל" משמש בדרך כלל כדי לציין תגובה למייל שנשלח לרשימה תפוצה או לקבוצה של נמענים, כך שהתגובה תישלח לכל הנמענים המקוריים.

source: forward
he: העברה קדימה

source: View next email
he: הצג דוא"ל הבא

source: Next
he: הבא

source: View previous email
he: הצג דוא"ל קודם

source: Previous
he: קודם

source: View the request
he: הצגת הבקשה

source: View original email
he: הצג דוא"ל מקורי

source: Download the original email as an EML file.
he: הורד את האימייל המקורי כקובץ EML.

source: Print preview
he: תצוגה מקדימה של הדפסה

source: Change
he: שינוי

source: View
he: הצג

source: Reply
he: השב

source: Reply all
he: השב לכולם

source: Forward
he: העבר הלאה

source: View office memos
he: הצג הערות משרדיות

source: Office memos
he: מזכרים פנימיים

source: Add
he: הוסף

source: Office memo
he: מזכר פנימי

source: View the correspondence on this Deal
he: הצגת ההתכתבות על עסקה זו

source: Import Email regarding this Deal
he: יבוא אימייל לגבי עסקה זו

source: View Deals with this Company
he: הצג עסקאות עם חברה זו

source: View the history of changes for this Deal
he: הצג את היסטוריית השינויים של עסקה זו

source: Toggle default deal sorting
he: התרגום הרוסי מציע תיאור מדויק של הפונקציה, אך התרגום לעברית צריך להיות תמציתי וממוקד. המילה "החלף" מעבירה את הרעיון של שינוי/המרה, והביטוי "ברירת מחדל" מתייחס להגדרות הסטנדרטיות.

source: A deal is created based on a request
he: עסקה נוצרת בהתבסס על בקשה

source: Last few letters
he: (K'ma ha'otiyot ha'acharonot)

source: Date
he: תאריך

source: View or Download
he: הצגנה או הורדה

source: Convert
he: המר

source: Total sum
he: סכום כולל

source: with VAT
he: כולל מע"מ

source: Filter
he: מסנן

source: Import Email regarding this Request
he: ייבא דוא"ל בקשר לבקשה זו

source: Create a request based on an email.
he: יצירת בקשה בהתבסס על דוא"ל.

source: Import request from
he: יבוא בקשה מ-

source: Create deal
he: יצירת עסקה

source: Please select files to attach to the letter.
he: נא בחרו קבצים לצרף למכתב.

source: Please choose a new owner for selected Companies and their Contact persons
he: בבקשה בחרו בעלים חדש לחברות הנבחרות ולנותני הקשר שלהן

source: Correctly delete this object as a duplicate.
he: מחק את האובייקט הזה ככפיל בצורה נכונה.

source: By %(filter_title)s
he: על ידי %(filter_title)s

source: Please select a file to import.
he: בבקשה בחר קובץ לייבוא.

source: Only the following columns will be imported if they exist (the order doesn't matter):
he: רק העמודות הבאות ייובאו אם הן קיימות (הסדר אינו משנה):

source: Make a choice
he: בחר אפשרות

source: Print
he: הדפסה

source: Received
he: התקבל

source: Prepared
he: מוכן

source: Select the original to which the linked objects will be reconnected.
he: בחרו במקור אליו יחוברו האובייקטים המקושרים.

source: Last month
he: חודש שעבר

source: First half of the year
he: חצי הראשון של השנה

source: Nine months of this year
he: תשעה חודשים של שנה זו

source: Second half of the last year
he: חצי השנייה של השנה שעברה

source: changed by chiefs
he: שונה על ידי המנהלים

source: Yes
he: כן

source: Partner
he: שותף

source: No
he: לא

source: Has Contacts
he: יש קשרים

source: mailbox
he: תיבת דואר

source: inbox
he: תיבת הנכנסים

source: sent
he: נשלחו

source: outbox ({num})
he: תיבת שליחה ({num})

source: trash
he: פח

source: No deal amount
he: אין סכום עסקה

source: Unacceptable phone number value
he: ערך מספר טלפון בלתי קביל

source: Counterparty
he: שותף עסקי

source: Error: The date you set as 'Created before' has to be later than the date of 'Created after'.
he: שגיאה: התאריך שהגדרת כ"נוצר לפני" חייב להיות מאוחר יותר מהתאריך של "נוצר לאחר".

source: Industries
he: תעשיות

source: Types
he: סוגים

source: Created before
he: נוצר לפני

source: Created after
he: נוצר לאחר

source: Received an email from "%s"
he: התקבל אימייל מ-"%s"

source: The Email has been sent to "%s"
he: הדוא"ל נשלח ל-%s

source: Please fill in the subject and text of the letter.
he: (אנא שימו לב: השדות "%s" הם מקומות שמיועדים להשלמה אוטומטית ויש להחליפם בטקסט המתאים.)

source: To send a message you need to have an email account marked as main.
he: כדי לשלוח הודעה, עליך להיות בעל חשבון דוא"ל מסומן כעיקרי.

source: Failed: %s
he: כשלון: %s

source: Owner changed successfully
he: הבעלים שונה בהצלחה

source: Dear {}, thanks for your request!
he: שלום {} תודה על בקשתך!

source: No recipient
he: אין נמען

source: The duplicate object has been correctly deleted.
he: האובייקט הכפול הוסר בהצלחה.

source: Not enough data to identify the email or email has been deleted
he: אין מספיק נתונים לזיהוי האימייל או שהאימייל נמחק

source: You do not have an email account in CRM for sending Emails. Contact your administrator.
he: אין לך חשבון דוא"ל ב-CRM לשליחת הודעות דוא"ל. צור קשר עם המנהל שלך.

source: Something went wrong
he: משהו השתבש

source: To add the correct link, use the tag /SECRET_CRM_PREFIX/ if necessary
he: כדי להוסיף קישור נכון, השתמשו בתגית /SECRET_CRM_PREFIX/ אם נדרש

source: list
he: רשימה

source: instance
he: דוגמה/מקרה ספציפי

source: Help page
he: עמוד עזרה

source: Help pages
he: דפי עזרה

source: app label
he: תווית היישום

source: model
he: מודל

source: page
he: עמוד

source: Title
he: כותרת

source: Available on CRM page
he: זמין בעמוד CRM

source: Available on one of CRM pages. Otherwise, it can only be accessed via a link from another help page.
he: זמין באחת מדפי ה-CRM. אחרת, ניתן לגשת אליו רק באמצעות קישור מדף עזרה אחר.

source: Paragraph
he: פסקה

source: Paragraphs
he: פסקאות

source: Groups
he: קבוצות

source: If no user group is selected then the paragraph will be available only to the superuser.
he: אם לא נבחרה קבוצת משתמשים, הפסקה תהיה זמינה רק למשתמש על.

source: Title of paragraph.
he: כותרת הפסקה.

source: draft
he: טיוטה

source: Will not be published.
he: לא יפורסם.

source: Content requires additional verification.
he: התוכן דורש אימות נוסף.

source: Index number
he: מספר אינדקס

source: The sequence number of the paragraph on the page.
he: מספר הסידורי של הפסקה בדף.

source: Link to a related paragraph if exists.
he: קישור לפסקה קשורה אם קיימת.

source: Service information
he: מידע על השירות

source: Please select recipients only with the same owner.
he: נא בחרו נמענים בעלי אותו בעלים בלבד.

source: Bad result - no recipients! Make another choice.
he: תוצאה לא טובה - אין נמענים! נא לבחור מחדש.

source: Create a mailing out for selected objects
he: יצירת דואר אלקטרוני המוני עבור עצמים נבחרים

source: Unsubscribed users were excluded from the mailing list.
he: משתמשים שהסירו את עצמם מהרשימה הוצאו מרשימת התפוצה.

source: Note massmail is not performed on the following days: Friday, Saturday, Sunday.
he: שימו לב ששלוח המוני לא מתבצע בימים הבאים: שישי, שבת, ראשון.

source: Merge selected mailing outs
he: מיזוג שליחות דואר נבחרות

source: united
he: מאוחדת

source: Specify VIP recipients
he: ציין נמענים VIP

source: Please first add your main email account.
he: נא הוסף תחילה את חשבון הדוא"ל הראשי שלך.

source: The main email address has been successfully assigned to the selected recipients.
he: כתובת הדוא"ל הראשית הוקצתה בהצלחה לנמענים הנבחרים.

source: Please select mailings with only the same recipient type.
he: נא בחרו בדואר אלקטרוני עם אותו סוג נמענים בלבד.

source: Please select only mailings with the same message.
he: בבקשה בחרו רק בדוא"לים עם אותו מסר.

source: There are no mail accounts available for mailing. Please contact your administrator.
he: אין חשבונות דוא"ל זמינים לשליחת הודעות. אנא פנה למנהל המערכת שלך.

source: There are no mail accounts available for mailing to non-VIP recipients. Please contact your administrator.
he: אין חשבונות דוא"ל זמינים לשליחת הודעות למקבלים שאינם VIP. אנא פנה למנהל המערכת שלך.

source: Mass mail
he: דואר זבל

source: The subject of the message. You can use {{first_name}}, {{last_name}}, {{first_middle_name}} or {{full_name}}
he: נושא ההודעה. ניתן להשתמש ב-{{first_name}}, {{last_name}}, {{first_middle_name}} או {{full_name}}

source: Choose signature
he: בחר חתימה

source: Sender's signature.
he: חתימת השולח.

source: Previous correspondence. Will be added after signature
he: התכתבות קודמת. תוסף לאחר החתימה

source: Email Account
he: חשבון דוא"ל

source: Email Accounts
he: חשבונות דוא"ל

source: The name of the Email Account. For example Gmail
he: שם חשבון הדוא"ל. לדוגמה, ג'ימייל

source: Use this account for regular business correspondence.
he: השתמש בחשבון זה להתכתבות עסקית שגרתית.

source: Allow to use this account for massmail.
he: אפשר להשתמש בחשבון זה לשליחת דואר המוני.

source: Import emails from this account.
he: ייבא אימיילים מחשבון זה.

source: The IMAP host
he: מארח IMAP

source: The username to use to authenticate to the SMTP server.
he: שם המשתמש לשימוש לאימות בשרת ה-SMTP.

source: The auth_password to use to authenticate to the SMTP server.
he: סיסמת האימות לשימוש באימות לשרת ה-SMTP.

source: The application password to use to authenticate to the SMTP server.
he: סיסמת היישום לשימוש לאימות בשרת ה-SMTP.

source: Port to use for the SMTP server
he: פורט לשימוש עבור שרת ה-SMTP

source: The from_email field.
he: שדה השולח (from_email).

source: If EMAIL_USE_SSL or EMAIL_USE_TLS is True, you can optionally specify the path to a PEM-formatted certificate chain file to use for the SSL connection.
he: אם EMAIL_USE_SSL או EMAIL_USE_TLS הם True, ניתן לציין באופן אופציונלי את הנתיב לקובץ שרשרת תעודות בפורמט PEM לשימוש בחיבור SSL.

source: If EMAIL_USE_SSL or EMAIL_USE_TLS is True, you can optionally specify the path to a PEM-formatted private key file to use for the SSL connection.
he: אם EMAIL_USE_SSL או EMAIL_USE_TLS מוגדרים כ-True, ניתן לציין באופן אופציונלי את הנתיב לקובץ מפתח פרטי בפורמט PEM לשימוש בחיבור SSL.

source: OAuth 2.0 token for obtaining an access token.
he: אסימון OAuth 2.0 לקבלת אסימון גישה.

source: DateTime of last import
he: תאריך ושעת היבוא האחרון

source: Specify the imap host
he: ציין את מארח ה-IMAP

source: Use HTML. To specify the address of the embedded image, use {% cid_media ‘path/to/pic.png' %}.<br> You can embed files uploaded to the CRM server in the ‘media/pics/’ folder or attached to this message.
he: ניתן להטמיע קבצים שהועלו לשרת ה-CRM בתיקייה ‘media/pics/’ או מצורפים להודעה זו.

source: Email Message
he: הודעת דוא"ל

source: Email Messages
he: הודעות דוא"ל

source: The queue of the user email accounts.
he: תור חשבונות דוא"ל של משתמשים.

source: Mailing Out
he: שליחת דואר המוני

source: Mailing Outs
he: שליחת דוא"ל המונית

source: Active but Error
he: פעילה אך עם שגיאות

source: Paused
he: מושבתת זמנית

source: Interrupted
he: נותקה

source: Done
he: בוצע

source: The name of the message.
he: שם ההודעה.

source: Number of recipients
he: מספר הנמענים

source: Recipients type
he: סוג הנמענים

source: Report
he: דו"ח

source: Use HTML. To specify the address of the embedded image, use {% cid_media ‘path/to/pic.png' %}.<br> You can embed files uploaded to the CRM server in the ‘media/pics/’ folder.
he: ניתן להטמיע קבצים שהועלו לשרת CRM בתיקייה 'media/pics/'.

source: Signatures
he: חתימות

source: The name of the signature.
he: שם החתימה.

source: price proposal
he: הצעת מחיר

source: Preview
he: תצוגה מקדימה

source: Edit
he: עריכה

source: Available Email accounts for MassMail
he: חשבונות דוא"ל זמינים לשליחת דואר המוני

source: Accounts
he: חשבונות

source: Today
he: היום

source: Sent today
he: נשלח היום

source: Note massmail is not performed on the following days: Friday, Saturday, Sunday.
he: שימו לב שהשליחה המונית לא מתבצעת בימים הבאים: שישי, שבת, ראשון.

source: notification
he: הודעה

source: Get or update a refresh token
he: קבל או עדכן טוקן רענון

source: Send a test
he: שלח מבחן

source: Copy message
he: העתק הודעה

source: Successful recipients
he: מקבלים מוצלחים

source: Failed recipients
he: נמענים נכשלים

source: Send failed recipients
he: נמענים שלא נשלח אליהם בהצלחה

source: Upload the image file to the CRM server
he: העלה את קובץ התמונה לשרת ה-CRM.

source: Please select an image file to upload.
he: נא בחר קובץ תמונה להעלאה.

source: To specify the address of the uploaded file, use the tag -
he: כדי לציין את כתובת הקובץ שהועלה, השתמשו בתגית -

source: Upload only files that will be used many times. For example, a company logo.
he: העלו רק קבצים שישמשו פעמים רבות. לדוגמה, לוגו של חברה.

source: View the uploaded images on the CRM server
he: הצגת התמונות שהועלו לשרת ה-CRM

source: Upload an image file to the CRM server
he: העלאת קובץ תמונה לשרת ה-CRM

source: Uploaded images
he: תמונות שהועלו

source: Done successfully.
he: בוצע בהצלחה.

source: Allowed file extensions:
he: סיומות קבצים מותרות:

source: Refresh token received successfully.
he: טוקן הרענון התקבל בהצלחה.

source: Error: Failed to get authorization code.
he: שגיאה: לא ניתן לקבל את קוד האישור.

source: Failed recipients has been returned to the massmail successfully.
he: הנמענים שלא הצליחו נשלחו בהצלחה בחזרה לדוא"ל ההמוני.

source: The Email test has been sent to {email_accounts}
he: בדיקות הדוא"ל נשלחו ל-{email_accounts} בהצלחה.

source: Settings
he: הגדרות

source: Banned company name
he: שם חברה חסומה

source: Banned company names
he: שמות חברות אסורות

source: Public email domain
he: תחום דוא"ל ציבורי

source: Public email domains
he: תחומי דוא"ל ציבוריים

source: Domain
he: תחום (דומיין)

source: Reminder settings
he: הגדרות תזכורות

source: Check interval
he: מרחק זמן בדיקה

source: Specify the interval in seconds to check if it's time for a reminder.
he: ציין את המרווח בשניות לבדיקת הגעת זמן התזכורת.

source: Stop Phrase
he: ביטוי עצירה

source: Stop Phrases
he: הערה: בתרגום זה, "Stop Phrases" תורגם כ"ביטויים לעצירה", המשקף את הרעיון של משפטים או מילים המשמשים להפסקת פעולה או תהליך. המילה "עצירה" מעבירה את המשמעות של הפסקה או הפסקה פתאומית, אשר מתאימה להקשר של ביטויים המשמשים לבלימת תהליך או אינטראקציה.

source: Phrase
he: משפט

source: Last occurrence date
he: תאריך המקרה האחרון

source: Date of last occurrence of the phrase
he: תאריך ההופעה האחרונה של הביטוי

source: Change responsible
he: הערה: בתרגום לעברית, "אחראים" הוא צורת רבים של "אחראי", המתאימה לתיאור מספר אנשים האחראים על משימה או תחום מסוים.

source: Change subscribers
he: שינוי מנויים

source: Tasks
he: משימות

source: Please specify a name
he: נא ציין שם

source: Please specify a responsible
he: נא לציין את האחראים

source: Date should not be in the past.
he: התאריך לא צריך להיות בעבר.

source: Memo
he: פתק

source: Memos
he: מזכרים

source: postponed
he: דחוי

source: reviewed
he: נבדק

source: to whom
he: אל מי

source: Task
he: משימה

source: For what
he: למה

source: Project
he: פרויקט

source: Сonclusion
he: סיכום

source: Draft
he: טיוטה

source: Available only to the owner.
he: זמין רק לבעלים.

source: Notified
he: הודעו

source: The recipient and subscribers are notified.
he: הנמען והמנויים מודעים לכך.

source: Review date
he: תאריך סקירה

source: subscribers
he: מנויים

source: Notified subscribers
he: מנויים שהודעו

source: The office memo has been reviewed
he: המם המשרדית נבדקה

source: Projects
he: פרויקטים

source: Project stage
he: שלב הפרויקט

source: Project stages
he: שלבי הפרויקט

source: Is the project active at this stage?
he: האם הפרויקט פעיל בשלב זה?

source: Resolution
he: החלטה

source: Resolutions
he: החלטות

source: Mark if this stage is "done"
he: סמן אם שלב זה "בוצע"

source: In progress
he: בביצוע/ בתהליך

source: Mark if this stage is "in progress"
he: סמן אם השלב הזה "בביצוע"

source: Tag for
he: תווית עבור

source: task
he: משימה

source: project
he: פרויקט

source: Hide main task
he: הסתר משימת עיקרית

source: Hide the main task when this sub-task is closed.
he: הסתר את המשימה הראשית כאשר תת-המשימה הזו נסגרת.

source: Lead time
he: זמן השקעה

source: Task execution time in format - DD HH:MM:SS
he: (פורמט הזמן הוא יום-שעה:דקה:שנייה)

source: The task cannot be closed because there is an active subtask.
he: לא ניתן לסגור את המשימה מכיוון שיש תת-משימה פעילה.

source: The main task is closed automatically.
he: המשימה העיקרית נסגרה אוטומטית.

source: Low
he: נמוך

source: Middle
he: אמצעי

source: High
he: גבוה

source: Short title
he: כותרת משנית

source: Start date
he: תאריך התחלה

source: Date of task closing
he: תאריך סגירת המשימה

source: Notified responsible
he: הערה: התרגום משקף את המשמעות המקורית של הטקסט האנגלי תוך התאמה להקשר הנדרש. המילה "Notified" תורגמה כ"הודעה" כדי לשמור על משמעות של הודעה או יידוע, והמילה "responsible" תורגמה כ"אחראים" כדי לציין את האנשים או הגורמים האחראים.

source: Task stage
he: שלב המשימה

source: Task stages
he: שלבי המשימה

source: Is the task active at this stage?
he: האם המשימה פעילה בשלב זה?

source: done
he: בוצע

source: canceled
he: בוטל

source: to make a decision
he: לקבל החלטה

source: payment of regular expenses
he: תשלום הוצאות קבועות

source: on approval
he: לאישור

source: for consideration
he: לשיקול דעת

source: for information
he: למידע נוסף

source: for the record
he: לצורך הרישום

source: overdue
he: חורג מהמועד האחרון

source: You are subscribed to a new office memo
he: אתה מנוי על הודעה משרדית חדשה

source: unreviewed
he: לא נבדקה

source: The office memo was written
he: הזכרון הדברים המשרדית נכתבה

source: You've received a office memo
he: קיבלת מזכר פנימי

source: Your office memo has been deleted
he: מזכרתך המשרדית נמחקה

source: View the task
he: הצג משימה

source: View the project
he: הצגת הפרויקט

source: View the
he: הצגת

source: Acquainted with the project
he: להכיר את הפרויקט

source: The project was created
he: הפרויקט נוצר

source: I completed my part of the task
he: השלמתי את חלקי במשימה.

source: The task was created
he: המשימה נוצרה

source: The subtask was created
he: נתצרה תת-משימה

source: The subtask
he: תת-משימה

source: later than due date of parent task.
he: אחרי תאריך היעד של המשימה הראשית.

source: Main task
he: משימה ראשית

source: Create subtask
he: יצירת תת-משימה

source: This is a collective task. Please create a sub-task for yourself for work. Or press the next button when you have done your job.
he: או לחץ על הכפתור הבא כאשר סיימת את עבודתך.

source: You have been assigned as the task co-owner
he: נמנתה כבעלים משותף של המשימה

source: Acquainted with the task
he: להתעדכן במשימה

source: The task is closed
he: המשימה נסגרה

source: The subtask is closed
he: ה-משימה נסגרה

source: The next step date should not be later than due date.
he: תאריך השלב הבא לא צריך להיות מאוחר יותר מתאריך ההגשה.

source: The Project was created
he: הפרויקט נוצר

source: The project is closed
he: הפרויקט נסגר

source: You are subscribed to a new task
he: אתה מנוי למשימה חדשה

source: You have a new task assigned
he: הוקצה לך משימה חדשה

source: Please edit the title and description to make it clear to other users what part of the overall task will be completed.
he: אנא ערוך את הכותרת והתיאור כדי להבהיר למשתמשים אחרים איזה חלק מהמשימה הכוללת יושלם.

source: responsible
he: אחראים

source: Attach files
he: צרף קבצים

source: Create task
he: יצירת משימה

source: Create project
he: יצירת פרויקט

source: View main task
he: הצג משימה ראשית

source: Subtasks
he: תת-משימות

source: Toggle default task sorting
he: (Translation explanation: "Toggle" is translated as "החלף" which means to switch or toggle. "Default task sorting" is translated as "מיון מטלות ברירת מחדל" which means default sorting of tasks.)

source: Mark the task as completed and save.
he: סימון המשימה כמבוצעת ושמירה.

source: The task cannot be marked as completed because you have an active subtask.
he: לא ניתן לסמן את המשימה כמשופרת מכיוון שיש לך תת-משימה פעילה.

source: The Task does not exist
he: המשימה לא קיימת

source: The user does not exist
he: המשתמש לא קיים

source: An error occurred while creating the subtask. Contact the CRM Administrator.
he: אירעה שגיאה בעת יצירת תת-המשימה. אנא פנה למנהל מערכת ה-CRM.

source: Creates a copy of the department
he: יוצר עותק של המחלקה

source: Copy department
he: מחלקת העתקים

source: Transfer of a manager to another department
he: העברת מנהל למחלקה אחרת

source: Transfer of a manager
he: העברת מנהל

source: Skip to main content
he: עבר לתוכן העיקרי

source: Welcome,
he: ברוך הבא,

source: View site
he: הצג אתר

source: Documentation
he: תיעוד

source: Change password
he: שינוי סיסמה

source: Log out
he: התנתק

source: Breadcrumbs
he: נתיב ניווט

source: Toggle theme (current theme: auto)
he: החלפת נושא (נושא נוכחי: אוטומטי)

source: Toggle theme (current theme: light)
he: החלפת נושא (נושא נוכחי: בהיר)

source: Toggle theme (current theme: dark)
he: החלף נושא (נושא נוכחי: כהה)

source: Specify dates
he: ציין תאריכים

source: from
he: מאת

source: before
he: לפני

source: YYYY-MM-DD
he: פורמט זה מייצג תאריך בשנה, עם ארבע ספרות לשנת, שתי ספרות לחודש ושתי ספרות ליום. לדוגמה, 2023-10-26 מייצג את ה-26 באוקטובר 2023.

source: Help
he: עזרה

source: This field is required.
he: שדה זה הוא חובה.

source: PBX extension
he: סיומת טלפון פנימי

source: SIP connection
he: חיבור SIP

source: Virtual phone number
he: מספר טלפון וירטואלי

source: Number
he: מספר

source: Caller ID
he: זיהוי מתקשר

source: Specify the number to be displayed as your phone number when you call
he: ציין את המספר שיוצג כמספר הטלפון שלך בעת ביצוע שיחה.

source: Provider
he: ספק/ת שירותים

source: Specify VoIP service provider
he: ציין ספק שירותי VoIP (טלפוניה באינטרנט)
