#--------------------------------------------------------------------------------
# 참조 모듈 목록.
#--------------------------------------------------------------------------------
from __future__ import annotations
from typing import Awaitable, Callable, Final, Generic, Iterable, Iterator, Optional, Sequence, Type, TypeVar, Tuple, Union
from typing import ItemsView, KeysView, ValuesView
from typing import Any, List, Dict, Set
from typing import cast, overload
import builtins
import os
import sys
from unittest import TestCase



#--------------------------------------------------------------------------------
# 테스트 케이스 클래스. (유닛테스트 기반)
#--------------------------------------------------------------------------------
class TestClass(TestCase):
	#--------------------------------------------------------------------------------
	# 멤버 변수 목록.
	#--------------------------------------------------------------------------------


	#--------------------------------------------------------------------------------
	# 초기화 라이프사이클 메서드.
	#--------------------------------------------------------------------------------
	def __init__(thisInstance, methodName: str = "runTest") -> None:
		base = super()
		base.__init__(methodName)


	#--------------------------------------------------------------------------------
	# 초기화 라이프사이클 메서드.
	#--------------------------------------------------------------------------------
	def OnCreate(thisInstance) -> None:
		pass


	# #--------------------------------------------------------------------------------
	# # 강제 실패.
	# #--------------------------------------------------------------------------------
	# def Fail(thisInstance) -> None:
	# 	thisInstance.fail()
		