def печать(
        текст,
        красный=False,
        зелёный=False,
        синий=False,
        жёлтый=False,
        стиль = None,
        не_печатоть =False
):
    
    def определить_стиль(стиль):
        if not стиль:
            return ""

        СТИЛИ = {
            "ж": 1,
            "к": 3,
            "ч": 4,
            "з": 9, 
        }
        накопительная = ""
        for буква in стиль:
            код_стиля = СТИЛИ.get(буква)
            этот_стиль = f";{код_стиля}"
            накопительная += этот_стиль

        return накопительная    
        # при комбинировании жирного и зачёркнутого должен получиться результат 
        # ;1;9
        # курсиввый и подчёркнутый ;3;4
        # жирфный и курсивный ;1;3

#   определённные символы в начале и в конце написаны на с++ и отвечаеи на кодировку цвета
    
    # первая часть строки задоёт стиль света и формат шрифта
    # \x1B[ специальная функция 
    # 38;2; -другого цвета формата ргб
    # 255;0;0 цвет в форме ргб
    # 4 подчёркивасть стиля шрифта
    # m завершает настройку шрифта
# результат = "\x1B[38;2;255;0;0;4m" + текст + "\x1B[0m"
    
    готовый_стиль = определить_стиль(стиль)

    if красный: 
        цвет = "255;0;0"
    elif зелёный:
        цвет = "0;255;0"
    elif синий:
        цвет = "0;0;255"
    elif жёлтый:
        цвет = "255;255;0"
    else:
        цвет = "255;255;255"
    результат = f"\x1B[38;2;{цвет}{готовый_стиль}m{текст}\x1B[0m"
    if не_печатоть:
        return результат
    print(результат)
# если оставить строки с запускам функций в нутри файла с модулем то они будут выполнены в момент ИМПОРТА этогомодуля
# что бы это не допустить но при этом оставить возможность испытывать  этот файл модуля "прямо здесь", например чтобы привести его отладку
# надо эту строку убрать внутрь блока ЕСЛИ который будет проверять откеуда запущен этот файл 
# ЕСЛИ запуск произошёл из этого файла (если он не импортировался)
if __name__ == "__main__":
    печать("красный", красный=True)
    печать("зелёный", зелёный=True)
    печать("синий", синий=True)
    печать("жёлтый", жёлтый=True)

    красный =печать("красный", красный=True, не_печатоть=True)
    зелёный =печать("зелёный", зелёный=True, не_печатоть=True)
    разноцветная_строка = f"{красный} и {зелёный}"
    print(разноцветная_строка)